Table of Contents
 Class ResultsData<T>
Namespace
IdeaStatiCa.BimApiLink.Results
Assembly
IdeaStatiCa.BimApiLink.dll
public class ResultsData<T> where T : IIdeaObjectWithResults
Type Parameters
T
Inheritance
object
ResultsData<T>
Inherited Members
 object.ToString()
 object.Equals(object)
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
Constructors
 ResultsData(T, IIdeaResult)
public ResultsData(T @object, IIdeaResult results)
Parameters
object T
results IIdeaResult
Properties
 Object
public T Object { get; }
Property Value
T
 Results
public IIdeaResult Results { get; }
Property Value
IIdeaResult
 Edit this page